<?php

return [
    'global' => [
        'required' => 'هذا الحقل مطلوب.',
        'string' => 'يجب أن يكون النص عبارة عن حروف.',
        'numeric' => 'يجب أن تكون القيمة رقمية.',
        'integer' => 'يجب أن تكون القيمة عددًا صحيحًا.',
        'email' => 'يرجى إدخال بريد إلكتروني صحيح.',
        'unique' => 'هذه القيمة مستخدمة من قبل.',
        'exists' => 'العنصر المحدد غير موجود.',
        'max' => [
            'string' => 'يجب ألا يتجاوز عدد الأحرف :max.',
            'file' => 'يجب ألا يتجاوز حجم الملف :max كيلوبايت.',
        ],
        'min' => [
            'string' => 'يجب ألا يقل عدد الأحرف عن :min.',
        ],
        'confirmed' => 'تأكيد الحقل غير متطابق.',
        'image' => 'يجب أن يكون الملف صورة بصيغة صحيحة.',
        'in' => 'القيمة المختارة غير صحيحة.',
        'date' => 'يجب أن يكون التاريخ بصيغة صحيحة.',
        'after' => 'يجب أن يكون التاريخ بعد :date.',
        'before' => 'يجب أن يكون التاريخ قبل :date.',
        'boolean' => 'الحقل يجب أن يكون إما نعم أو لا.',
        'array' => 'يجب أن يكون الحقل مصفوفة.',
    ]
];
